AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.3.0/mcu/apollo510/regs/am_mcu_apollo510_mraminfo0.h
// NV_CONFIG2 - Device specific configuration used to configure the MRAM recovery NV device. For a MSPI device this value is written directly to the specified module's DEV0DDR register. (Refer to the specified MSPI register for field definitions). For an EMMC device this location is unused.
#define AM_REG_INFO0_NV_CONFIG2_CONFIG2_S 0
#define AM_REG_INFO0_NV_CONFIG2_CONFIG2_M 0xFFFFFFFF
#define AM_REG_INFO0_NV_CONFIG2_CONFIG2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_NV_CONFIG2_CONFIG2_Pos 0
#define AM_REG_INFO0_NV_CONFIG2_CONFIG2_Msk 0xFFFFFFFF

// NV_CONFIG3 - Device specific configuration used to configure the MRAM recovery NV device. For a MSPI device this value is written directly to the specified module's DEV0SCRAMBLING register.(Refer to the specified MSPI register for field definitions). For an EMMC device this location is unused.
#define AM_REG_INFO0_NV_CONFIG3_CONFIG3_S 0
#define AM_REG_INFO0_NV_CONFIG3_CONFIG3_M 0xFFFFFFFF
#define AM_REG_INFO0_NV_CONFIG3_CONFIG3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_INFO0_NV_CONFIG3_CONFIG3_Pos 0
#define AM_REG_INFO0_NV_CONFIG3_CONFIG3_Msk 0xFFFFFFFF

// NV_OPTIONS - Device specific options for the selected MRAM recovery device type.  Each field is used only for the device type specified (EMMC or MSPI) and is unused and ignored when not configured for the specified type.  Refer to the specified MSPI/EMMC registers for further information of the specific register and field's usage.
#define AM_REG_INFO0_NV_OPTIONS_EMMC_BUS_WIDTH_S 28
#define AM_REG_INFO0_NV_OPTIONS_EMMC_BUS_WIDTH_M 0x70000000
#define AM_REG_INFO0_NV_OPTIONS_EMMC_BUS_WIDTH(n) (((uint32_t)(n) << 28) & 0x70000000)
#define AM_REG_INFO0_NV_OPTIONS_EMMC_BUS_WIDTH_Pos 28
#define AM_REG_INFO0_NV_OPTIONS_EMMC_BUS_WIDTH_Msk 0x70000000
#define AM_ENUM_INFO0_NV_OPTIONS_EMMC_BUS_WIDTH_EMMC1           0x0  // 1-bit transfers
#define AM_ENUM_INFO0_NV_OPTIONS_EMMC_BUS_WIDTH_EMMC4           0x2  // 4-bit transfers
#define AM_ENUM_INFO0_NV_OPTIONS_EMMC_BUS_WIDTH_EMMC8           0x3  // 8-bit transfers
#define AM_REG_INFO0_NV_OPTIONS_EMMC_VOLTAGE_S 26
#define AM_REG_INFO0_NV_OPTIONS_EMMC_VOLTAGE_M 0x0C000000
#define AM_REG_INFO0_NV_OPTIONS_EMMC_VOLTAGE(n) (((uint32_t)(n) << 26) & 0x0C000000)
#define AM_REG_INFO0_NV_OPTIONS_EMMC_VOLTAGE_Pos 26
#define AM_REG_INFO0_NV_OPTIONS_EMMC_VOLTAGE_Msk 0x0C000000
#define AM_ENUM_INFO0_NV_OPTIONS_EMMC_VOLTAGE_RSVD              0x0  // Unused, reserved
#define AM_ENUM_INFO0_NV_OPTIONS_EMMC_VOLTAGE_EMMCV18           0x1  // 1.8v I/O
#define AM_ENUM_INFO0_NV_OPTIONS_EMMC_VOLTAGE_EMMCV30           0x2  // 3.0v I/O
#define AM_ENUM_INFO0_NV_OPTIONS_EMMC_VOLTAGE_EMMCV33           0x3  // 3.3v I/O
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READ_CLKSEL_S 20
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READ_CLKSEL_M 0x00F00000
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READ_CLKSEL(n) (((uint32_t)(n) << 20) & 0x00F00000)
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READ_CLKSEL_Pos 20
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READ_CLKSEL_Msk 0x00F00000
#define AM_REG_INFO0_NV_OPTIONS_MSPI_WIDTHS_S 16
#define AM_REG_INFO0_NV_OPTIONS_MSPI_WIDTHS_M 0x000F0000
#define AM_REG_INFO0_NV_OPTIONS_MSPI_WIDTHS(n) (((uint32_t)(n) << 16) & 0x000F0000)
#define AM_REG_INFO0_NV_OPTIONS_MSPI_WIDTHS_Pos 16
#define AM_REG_INFO0_NV_OPTIONS_MSPI_WIDTHS_Msk 0x000F0000
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CLKSEL_S 12
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CLKSEL_M 0x0000F000
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CLKSEL(n) (((uint32_t)(n) << 12) & 0x0000F000)
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CLKSEL_Pos 12
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CLKSEL_Msk 0x0000F000
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_S 8
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_M 0x00000F00
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL(n) (((uint32_t)(n) << 8) & 0x00000F00)
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_Pos 8
#define AM_REG_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_Msk 0x00000F00
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_None     0x0  // No Pre-CMDs are sent. The first MSPI command to the device will be the command contained in the MSPI_READCMD.
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_Cxxx     0x1  // One single byte command (PCMD1=CMD1)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CCxx     0x2  // Two commands (PCMD1=CMD1, and PCMD2=CMD2)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CDxx     0x3  // One command with one data byte for the command (PCMD1=CMD1, and PCMD2=DATA)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CCCx     0x4  // Three single byte commands (PCMD1=CMD1, PCMD2=CMD2 and PCMD3=CMD3)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CCDx     0x5  // Two CMDs, with one data byte following the second command (PCMD1=CMD1, PCMD2=CMD2, PCMD3=DATA)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CDCx     0x6  // Two CMDs, with one data byte following the first command (PCMD1=CMD1, PCMD2=DATA, PCMD3=CMD2)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CDDx     0x7  // One CMD, with two data bytes following the first command (PCMD1=CMD1, PCMD2=DATA, PCMD3=DATA)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CCCC     0x8  // Four single byte commands (PCMD1=CMD1, PCMD2=CMD2, PCMD3=CMD3, PCMD4=CMD4)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CCCD     0x9  // Three commands with one data byte following the third command (PCMD1=CMD1, PCMD2=CMD2, PCMD3=CMD3, PCMD4=DATA)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CCDC     0xA  // Three commands with one data byte following the second command (PCMD1=CMD1, PCMD2=CMD2, PCMD3=DATA, PCMD4=CMD3)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CDCC     0xB  // Three commands with one data byte following the first command (PCMD1=CMD1, PCMD2=DATA, PCMD3=CMD2, PCMD4=CMD3)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CDCD     0xC  // Two commands with one data byte following the each command (PCMD1=CMD1, PCMD2=DATA, PCMD3=CMD2, PCMD4=DATA)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CCDD     0xD  // Two commands with two data bytes following the second command (PCMD1=CMD1, PCMD2=CMD2, PCMD3=DATA, PCMD4=DATA)
#define AM_ENUM_INFO0_NV_OPTIONS_MSPI_PRECMD_CTRL_PCMD_CDDC     0xE  // Two commands with two data bytes following the first command (PCMD1=CMD1, PCMD2=DATA, PCMD3=DATA, PCMD4=CMD2)
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READCMD_S 0
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READCMD_M 0x000000FF
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READCMD(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READCMD_Pos 0
#define AM_REG_INFO0_NV_OPTIONS_MSPI_READCMD_Msk 0x000000FF

// NV_MSPI_PRECMDS - Pre-Commands sent prior to the Read command that loads the recovery image(s) for MSPI NV devices. How the four PCMDx fields are used is controlled by MSPI_PRECMD_CTRL the NV_OPTIONS word. Each command is sent followed by the delay time specified in the RESET_DLY and RESET_DLY_UNITS fields in the NV_OPTIONS word. The clock speed used to send the pre-commands is specified in the MSPI_PRECMD_CLKSEL field also in the NV_OPTIONS word.
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD1_S 24
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD1_M 0xFF000000
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD1(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD1_Pos 24
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD1_Msk 0xFF000000
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD2_S 16
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD2_M 0x00FF0000
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD2(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD2_Pos 16
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD2_Msk 0x00FF0000
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD3_S 8
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD3_M 0x0000FF00
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD3(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD3_Pos 8
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD3_Msk 0x0000FF00
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD4_S 0
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD4_M 0x000000FF
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD4(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD4_Pos 0
#define AM_REG_INFO0_NV_MSPI_PRECMDS_PCMD4_Msk 0x000000FF

// MRAM_RCV_RETRIES_TIMES - The number of retries if MRAM recovery fails and the times between retries.
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRIES_S 16
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRIES_M 0xFFFF0000
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRIES(n) (((uint32_t)(n) << 16) & 0xFFFF0000)
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRIES_Pos 16
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRIES_Msk 0xFFFF0000
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MIN_RETRY_TIME_S 8
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MIN_RETRY_TIME_M 0x0000FF00
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MIN_RETRY_TIME(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MIN_RETRY_TIME_Pos 8
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MIN_RETRY_TIME_Msk 0x0000FF00
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRY_TIME_S 0
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRY_TIME_M 0x000000FF
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRY_TIME(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRY_TIME_Pos 0
#define AM_REG_INFO0_MRAM_RCV_RETRIES_TIMES_MAX_RETRY_TIME_Msk 0x000000FF

#endif
